# Taps
tap "homebrew/cask-versions"


# Formulae
brew "azure-cli"
brew "bat"
brew "coreutils"
brew "chezmoi"
brew "jq"
brew "nano"
brew "ocrmypdf"
brew "tesseract-lang"
brew "trash"
brew "watch"
# Containers
brew "docker"
brew "podman"


# Kubernetes Management
tap "fluxcd/tap"
tap "int128/kubelogin"

brew "kubernetes-cli"
brew "kustomize"
brew "fluxcd/tap/flux"
brew "kubectx"
brew "int128/kubelogin/kubelogin"


# Custom Formulae
tap "codello/brewery"
brew "codello/brewery/srtlab"


# Casks
cask "1password"
cask "1password-cli"
cask "appcleaner"
cask "paragon-ntfs"
cask "parallels"

# Development Tools
cask "iterm2"
cask "tower"
cask "jetbrains-toolbox"

# Utilities
cask "downie"
cask "typora"

# Media Apps
cask "iina"
cask "imageoptim"
cask "invisor-lite"
cask "subler"
# cask "xld"

# LaTeX
# cask "basictex"
# cask latexit

# QuickLook
cask "qlstephen"   # QLStephen
cask "qlmarkdown"  # QLMarkdown
# cask "qlvideo"     # QLVideo

# Fonts
tap "homebrew/cask-fonts"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"


# Mac App Store Apps
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
mas "Things", id: 904280696
