# Taps
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "codello/brewery"
tap "int128/kubelogin"


# Formulae
brew "azure-cli"
brew "bat"
brew "coreutils"
brew "chezmoi"
brew "fluxcd/tap/flux"
brew "jq"
brew "kubernetes-cli"
brew "kustomize"
brew "int128/kubelogin/kubelogin"
brew "nano"
brew "codello/brewery/srtlab"
brew "trash"
brew "watch"


# Casks
cask "1password"
cask "1password-cli1"
cask "appcleaner"
cask "paragon-ntfs"
cask "parallels"

# Development Tools
cask "iterm2"
cask "tower"
cask "jetbrains-toolbox"
cask "nova"
cask "docker"
cask "firefox"
cask "lens"

# Utilities
cask "downie"
cask "dupeguru"
cask "typora"

# Media Apps
cask "iina"
cask "imageoptim"
cask "invisor-lite"
cask "subler"
cask "xld"

# LaTeX
cask "basictex"
#cask latexit

# QuickLook
cask "qlstephen"  # QLStephen
cask "qlmarkdown" # QLMarkdown
cask "qlvideo"    # QLVideo

# Fonts
cask "font-jetbrains-mono"
cask "font-jetbrainsmono-nerd-font"


# Mac App Store Apps
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
mas "Things", id: 904280696
